Autodesk.Revit.DB.Analysis.MassLevelData.IsValidConceptualConstructionTypeElement(Autodesk.Revit.DB.ElementId)
Checks if the ElementId is an acceptable conceptual construction type ElementId for the MassLevelData (Mass Floor).
Remarks:
In the case that 'conceptualConstructionIsByEnergyData' is true, invalidElementId is also acceptable input.
id:
The ElementId to be checked.
Returns:
True if the ElementId is an acceptable conceptual construction type ElementId, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Analysis.MassLevelData.IsMassFamilyInstance(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Checks if the ElementId is a mass family instance.
document:
The document.
id:
The ElementId to be checked.
Returns:
True if the ElementId is a mass family instance, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Analysis.MassLevelData.ConceptualConstructionId
The ElementId of the conceptual construction associated with the MassLevelData (Mass Floor).
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input ElementId conceptualConstructionId is not a valid conceptual construction type ElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Analysis.MassLevelData.MaterialId
The ElementId of the visualization material used for the MassLevelData (Mass Floor)
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input element materialId is not a material element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Analysis.MassLevelData.StrUsage
A String which describes the usage or occupancy type of the level of the MassLevelData.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012